System Bootstrap, Version 15.1(4)M4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 2010 by cisco Systems, Inc.
Total memory size = 512 MB - On-board = 512 MB, DIMM0 = 0 MB
CISCO1941/K9 platform with 524288 Kbytes of main memory
Main memory is configured to 64/-1(On-board/DIMM0) bit mode with ECC disabled

Readonly ROMMON initialized

program load complete, entry point: 0x80803000, size: 0x1b340
program load complete, entry point: 0x80803000, size: 0x1b340

IOS Image Load Test
___________________
Digitally Signed Release Software
program load complete, entry point: 0x81000000, size: 0x2bb1c58
Self decompressing the image :
######################### [OK]
Smart Init is enabled
smart init is sizing iomem
                  TYPE      MEMORY_REQ
     Onboard devices &
          buffer pools      0x01E8F000
-----------------------------------------------
                TOTAL:      0x01E8F000
Rounded IOMEM up to: 32Mb.
Using 6 percent iomem. [32Mb/512Mb]

              Restricted Rights Legend
Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.
           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706

Cisco IOS Software, C1900 Software (C1900-UNIVERSALK9-M), Version 15.1(4)M4, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thurs 5-Jan-12 15:41 by pt_team
Image text-base: 0x2100F918, data-base: 0x24729040

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco CISCO1941/K9 (revision 1.0) with 491520K/32768K bytes of memory.
Processor board ID FTX152400KS
2 Gigabit Ethernet interfaces
DRAM configuration is 64 bits wide with parity disabled.
255K bytes of non-volatile configuration memory.
249856K bytes of ATA System CompactFlash 0 (Read/Write)

Press RETURN to get started!



Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#! Assign hostname
Router(config)#hostname CoreRouter
CoreRouter(config)#
CoreRouter(config)#! Interface to Core Switch (Trunk or Routed)
CoreRouter(config)#interface GigabitEthernet0/0
CoreRouter(config-if)# description Link to Core Switch
CoreRouter(config-if)# no shutdown

CoreRouter(config-if)# ip address 201.20.39.1 255.255.255.240
CoreRouter(config-if)#! Adjust IP/subnet per your addressing scheme
CoreRouter(config-if)#
CoreRouter(config-if)#! Optional if using subinterfaces for VLANs
CoreRouter(config-if)#interface GigabitEthernet0/0.10
CoreRouter(config-subif)# encapsulation dot1Q 10
CoreRouter(config-subif)# ip address 192.168.10.1 255.255.255.0
CoreRouter(config-subif)# no shutdown
CoreRouter(config-subif)#
CoreRouter(config-subif)#interface GigabitEthernet0/0.20
CoreRouter(config-subif)# encapsulation dot1Q 20
CoreRouter(config-subif)# ip address 192.168.20.1 255.255.255.0
CoreRouter(config-subif)# no shutdown
CoreRouter(config-subif)#
CoreRouter(config-subif)#interface GigabitEthernet0/0.99
CoreRouter(config-subif)# encapsulation dot1Q 99
CoreRouter(config-subif)# ip address 192.168.99.1 255.255.255.0
CoreRouter(config-subif)# no shutdown
CoreRouter(config-subif)#
CoreRouter(config-subif)#! Interface to Firewall
CoreRouter(config-subif)#interface GigabitEthernet0/1
CoreRouter(config-if)# description Link to Firewall (Inside)
CoreRouter(config-if)# ip address 201.20.39.2 255.255.255.240
% 201.20.39.0 overlaps with GigabitEthernet0/0
CoreRouter(config-if)# no shutdown
% 201.20.39.0 overlaps with GigabitEthernet0/0
GigabitEthernet0/1: incorrect IP address assignment
CoreRouter(config-if)#
CoreRouter(config-if)#! Enable routing
CoreRouter(config-if)#ip routing
CoreRouter(config)#
CoreRouter(config)#! (Optional) Default route to Firewall
CoreRouter(config)#ip route 0.0.0.0 0.0.0.0 201.20.39.3
CoreRouter(config)#
CoreRouter(config)#end
CoreRouter#wr
Building configuration...
[OK]
CoreRouter#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

%LINK-3-UPDOWN: Interface GigabitEthernet0/0.10, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.10, changed state to up

%LINK-3-UPDOWN: Interface GigabitEthernet0/0.20, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.20, changed state to up

%LINK-3-UPDOWN: Interface GigabitEthernet0/0.99, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.99, changed state to up

%SYS-5-CONFIG_I: Configured from console by console

CoreRouter>enable
CoreRouter#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
CoreRouter(config)#
CoreRouter(config)#! make sure the interface you actually connected to the ASA is G0/1
CoreRouter(config)#interface GigabitEthernet0/1
CoreRouter(config-if)# description Link-to-ASA-inside
CoreRouter(config-if)# ip address 10.0.0.1 255.255.255.252
CoreRouter(config-if)# no shutdown

CoreRouter(config-if)#
CoreRouter(config-if)#end
CoreRouter#write memory
Building configuration...
[OK]
CoreRouter#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%SYS-5-CONFIG_I: Configured from console by console

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
CoreRouter>enable
CoreRouter#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
CoreRouter(config)#interface GigabitEthernet0/0
CoreRouter(config-if)# no shutdown
CoreRouter(config-if)#exit
CoreRouter(config)#interface GigabitEthernet0/0.10
CoreRouter(config-subif)# encapsulation dot1Q 10
CoreRouter(config-subif)# ip address 201.20.38.1 255.255.255.192
CoreRouter(config-subif)#exit
CoreRouter(config)#interface GigabitEthernet0/0.20
CoreRouter(config-subif)# encapsulation dot1Q 20
CoreRouter(config-subif)# ip address 201.20.38.65 255.255.255.192
CoreRouter(config-subif)#exit
CoreRouter(config)#interface GigabitEthernet0/0.30
CoreRouter(config-subif)# encapsulation dot1Q 30
CoreRouter(config-subif)# ip address 201.20.38.129 255.255.255.224
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.30, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.30, changed state to up

CoreRouter(config-subif)#ip routing
CoreRouter(config)#ip routing
CoreRouter(config)#ip dhcp pool COMLAB1
CoreRouter(dhcp-config)# network 201.20.38.0 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.1
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp pool COMLAB2
CoreRouter(dhcp-config)# network 201.20.38.64 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.65
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp pool NETWORKLAB
CoreRouter(dhcp-config)# network 201.20.38.128 255.255.255.224
CoreRouter(dhcp-config)# default-router 201.20.38.129
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#end
CoreRouter#
%SYS-5-CONFIG_I: Configured from console by console
write memory
Building configuration...
[OK]

CoreRouter>enable
CoreRouter#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
CoreRouter(config)#no interface GigabitEthernet0/0.10
CoreRouter(config)#no interface GigabitEthernet0/0.20
CoreRouter(config)#no interface GigabitEthernet0/0.30
CoreRouter(config)#no interface GigabitEthernet0/0.99
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.10, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.10, changed state to down

%LINK-3-UPDOWN: Interface GigabitEthernet0/0.20, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.20, changed state to down

%LINK-3-UPDOWN: Interface GigabitEthernet0/0.30, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.30, changed state to down

CoreRouter(config)#
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.99, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.99, changed state to down

CoreRouter(config)#interface GigabitEthernet0/0
CoreRouter(config-if)# no shutdown
CoreRouter(config-if)# ip address 201.20.39.2 255.255.255.240
CoreRouter(config-if)# no ip address dhcp
CoreRouter(config-if)#exit
CoreRouter(config)#interface GigabitEthernet0/1
CoreRouter(config-if)# no shutdown
CoreRouter(config-if)# ip address 10.0.0.1 255.255.255.252
CoreRouter(config-if)#exit
CoreRouter(config)#ip route 0.0.0.0 0.0.0.0 10.0.0.2
CoreRouter(config)#end
CoreRouter#
%SYS-5-CONFIG_I: Configured from console by console

CoreRouter#write memory
Building configuration...
[OK]

CoreRouter>enable
CoreRouter#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
CoreRouter(config)#ip dhcp pool ComLab1
CoreRouter(dhcp-config)# network 201.20.38.0 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.1
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)# lease 7
                         ^
% Invalid input detected at '^' marker.
	
CoreRouter(dhcp-config)#ip dhcp excluded-address 201.20.38.1 201.20.38.10^Z
CoreRouter#
%SYS-5-CONFIG_I: Configured from console by console

CoreRouter#ip dhcp pool ComLab1
              ^
% Invalid input detected at '^' marker.
	
CoreRouter#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
CoreRouter(config)#ip dhcp pool ComLab1
CoreRouter(dhcp-config)# network 201.20.38.0 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.1
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp excluded-address 201.20.38.1 201.20.38.10
CoreRouter(config)#ip dhcp pool ComLab2
CoreRouter(dhcp-config)# network 201.20.38.64 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.65
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)# lease 7
                         ^
% Invalid input detected at '^' marker.
	
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp excluded-address 201.20.38.65 201.20.38.75
CoreRouter(config)#ip dhcp pool ComLab2
CoreRouter(dhcp-config)#network 201.20.38.64 255.255.255.192
CoreRouter(dhcp-config)#default-router 201.20.38.65
CoreRouter(dhcp-config)#dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp excluded-address 201.20.38.65 201.20.38.75
CoreRouter(config)#ip dhcp pool ComLab2
CoreRouter(dhcp-config)# network 201.20.38.64 255.255.255.192
CoreRouter(dhcp-config)# default-router 201.20.38.65
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#exit
CoreRouter(config)#ip dhcp excluded-address 201.20.38.129 201.20.38.133
CoreRouter(config)#ip dhcp pool NetworkLab
CoreRouter(dhcp-config)# network 201.20.38.128 255.255.255.224
CoreRouter(dhcp-config)# default-router 201.20.38.129
CoreRouter(dhcp-config)# dns-server 8.8.8.8
CoreRouter(dhcp-config)#
CoreRouter(dhcp-config)#exit
CoreRouter(config)#interface GigabitEthernet0/0.20
CoreRouter(config-subif)# encapsulation dot1Q 20
CoreRouter(config-subif)# ip address 201.20.38.1 255.255.255.192
CoreRouter(config-subif)# no shutdown
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.20, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.20, changed state to up

CoreRouter(config-subif)#exit
CoreRouter(config)#interface GigabitEthernet0/0.30
CoreRouter(config-subif)# encapsulation dot1Q 30
CoreRouter(config-subif)# ip address 201.20.38.65 255.255.255.192
CoreRouter(config-subif)# no shutdown
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.30, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.30, changed state to up

CoreRouter(config-subif)#exit
CoreRouter(config)#interface GigabitEthernet0/0.40
CoreRouter(config-subif)# encapsulation dot1Q 40
CoreRouter(config-subif)# ip address 201.20.38.129 255.255.255.224
CoreRouter(config-subif)# no shutdown
%LINK-3-UPDOWN: Interface GigabitEthernet0/0.40, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.40, changed state to up

CoreRouter(config-subif)#exit
CoreRouter(config)#ip route 0.0.0.0 0.0.0.0 201.20.39.1
CoreRouter(config)#end
CoreRouter#
%SYS-5-CONFIG_I: Configured from console by console

CoreRouter#write memory
Building configuration...
[OK]